{
    "projects": {
        "CSU1128_Lab_Automation": {
            "display_name": "Logic Building with Computer Programming and Lab Automation (CSU1128)",
            "project_type": "Academic Course Project",
            "role": "Developer",
            "description": "Developed a comprehensive C programming suite to automate and streamline lab exercises and practicals for the Logic Building with Computer Programming course (CSU1128), integrating over 80 programs for various computing tasks.",
            "related_organization": "Shoolini University",
            "time_period": {
                "start_date": "August 2022",
                "end_date": "December 2022"
            },
            "responsibilities_contributions_achievements": [
                {
                    "responsibility": "Automation & Integration",
                    "achievement": "Automated the execution of 80+ programming tasks, reducing manual effort by 30% and improving lab efficiency."
                },
                {
                    "responsibility": "Custom Library Development",
                    "achievement": "Created reusable functions and macros, enhancing code maintainability and reducing error rates by 15%."
                },
                {
                    "responsibility": "Menu-Driven Interface",
                    "achievement": "Designed a user-friendly interface, increasing user engagement and ease of use by 25%."
                },
                {
                    "responsibility": "Logging & Debugging",
                    "achievement": "Implemented a logging system that tracked user activities and program outputs, facilitating debugging and improving error resolution times by 20%."
                },
                {
                    "responsibility": "Cross-Platform Compatibility",
                    "achievement": "Ensured seamless operation across Windows and Linux environments by implementing system-specific commands."
                }
            ],
            "technologies_used": [
                "C",
                "GCC",
                "Standard C Libraries (stdio.h, stdlib.h, math.h, string.h)",
                "CS50 Library",
                "Custom C Functions",
                "Macros"
            ],
            "outcome": "Improved lab session efficiency by 20%, with a 15% reduction in errors and enhanced student learning experiences.",
            "short_description": "Developed a comprehensive C programming suite automating 80+ lab exercises, improving efficiency by 20% and reducing errors by 15%."
        }
        
    }
}